import type { ChartData } from "@/types/slides";

export const CHART_DEFAULT_DATA: { [key: string]: ChartData } = {
  bar: {
    labels: ["类别1", "类别2", "类别3", "类别4", "类别5"],
    legends: ["系列1", "系列2"],
    series: [
      [12, 19, 5, 2, 18],
      [7, 11, 13, 21, 9],
    ],
  },
  column: {
    labels: ["类别1", "类别2", "类别3", "类别4", "类别5"],
    legends: ["系列1", "系列2"],
    series: [
      [12, 19, 5, 2, 18],
      [7, 11, 13, 21, 9],
    ],
  },
  line: {
    labels: ["类别1", "类别2", "类别3", "类别4", "类别5"],
    legends: ["系列1", "系列2"],
    series: [
      [12, 19, 5, 2, 18],
      [7, 11, 13, 21, 9],
    ],
  },
  pie: {
    labels: ["类别1", "类别2", "类别3", "类别4", "类别5"],
    legends: ["值"],
    series: [[12, 19, 5, 2, 18]],
  },
  ring: {
    labels: ["类别1", "类别2", "类别3", "类别4", "类别5"],
    legends: ["值"],
    series: [[12, 19, 5, 2, 18]],
  },
  area: {
    labels: ["类别1", "类别2", "类别3", "类别4", "类别5"],
    legends: ["系列1", "系列2"],
    series: [
      [12, 19, 5, 2, 18],
      [7, 11, 13, 21, 9],
    ],
  },
  radar: {
    labels: ["类别1", "类别2", "类别3", "类别4", "类别5"],
    legends: ["系列1", "系列2"],
    series: [
      [12, 19, 5, 2, 18],
      [7, 11, 13, 21, 9],
    ],
  },
  scatter: {
    labels: ["坐标1", "坐标2", "坐标3", "坐标4", "坐标5"],
    legends: ["X", "Y"],
    series: [
      [12, 19, 5, 2, 18],
      [7, 11, 13, 21, 9],
    ],
  },
};
